//
//  XCKeyWordTool+DataSource.m
//  XCToolKit
//
//  Created by KevinWang on 2018/10/13.
//  Copyright © 2018年 YiZhuan. All rights reserved.
//

#import "XCKeyWordTool+DataSource.h"

@implementation XCKeyWordTool (DataSource)

// ms
/*
- (NSArray *)dataSource{
    return @[@"支持",//0
             @"我付出",//1
             @"他的宝贝",//2
             @"谁现在提出",//3
             @"哎真的很现实",//4
             @"他说太阳是红色",//5
             @"早上我背着书包哟",//6
             @"白酒是用酒精勾兑的",//7
             @"你有盾牌我有宝剑换不",//8
             @"今年农民伯伯又有好收成",//9
             @"你要不要考虑到大家的益处",//10
             @"哇瑟你看那边好好漂亮的钻戒",//11
             @"高高的上坡上哦都是黄土跟石头",//12
             @"你说啥为啥闹成这样了居然还分开",//13
             @"那谁小时候真开不出来现在这么成功",//14
             @"回想当年，风声雨声读书声声声入耳，多么怀念",//15
             @"光阴似箭，岁月如梭，有时间多多陪伴下父母吧",//16
             ];
}*/

/*
// hh
- (NSArray *)dataSource {
    return @[@"支撑",//0
             @"你付出",//1
             @"稀奇宝贝",//2
             @"我向你提问",//3
             @"我要去实现它",//4
             @"今天的花儿红彤彤",//5
             @"早餐我想吃面包牛奶",//6
             @"白酒是用酒精勾兑的",//7
             @"你问我换不换我不换~~",//8
             @"给你寄信希望能早日收到",//9
             @"好好学习将来对你是有益的",//10
             @"我要努力争取早日给她买钻戒",//11
             @"咬定青山不放松立根原在破石中",//12
             @"一收到这个好消息我马上跟你分享了",//13
             @"成功是不可能成功这辈子都不能成功的",//14
             @"来吟诗一首，小僧奉施军持水，弭耳来受救渴供。",//15
             @"阿明啊年轻人要多读书，唯有知识能伴你成长",//16
             ];
}*/

// tt
- (NSArray *)dataSource {
    return @[@"支气管炎",//0
             @"交付日期短",//1
             @"海绵宝宝续集",//2
             @"古驰手提包限量",//3
             @"哥伦布发现新大陆",//4
             @"喜洋洋打败红太狼啦",//5
             @"给我来个芹菜包子谢谢",//6
             @"祷祠而求福，雩兑而请雨",//7
             @"又如：以帛换酒；换过子。",//8
             @"俗话说古来白骨无人收真凄惨",//9
             @"电视广告经常说是你的益达收好",//10
             @"你分析问题的角度非常刁钻佩服啊",//11
             @"其实很多中国人都不知道一石是个单位",//12
             @"多喝热水，重启试试，不行就分这么简单",//13
             @"入秋了这次的战役很重要啊是否成功看天气",//14
             @"耳听为虚眼见为实，并不一定有时耳听有可能更真实",//15
             @"经历过磨难，身处过艰险才知道小伙伴的重要", //16
             @"和风送暖华夏意，谐成安乐福寿齐。兔欲月娥奔前路，年复今朝寄往昔" //17
             ];
}

@end
